- abc
- - test1
  - test2
  - test3
- def
...
---
- command-line: ytool -E :0
  output: "abc"
- command-line: ytool -E :2
  output: "def"
- command-line: ytool -E :1
  output: "- test1\n- test2\n- test3\n"
- command-line: ytool -E :1:0
  output: "test1"
- command-line: ytool -E :1:1
  output: "test2"
- command-line: ytool -E :1:2
  output: "test3"
- command-line: ytool -E :1:3
  result: 1
